## Applying learned functions

In [2]:
#import libraries
import pandas as pd
import numpy as np

In [3]:
data = pd.DataFrame({"Name": ['bread', 'beer', 'butter','cheese'],
                     "Type": ["bakery", "drinks", "deli", "deli"],
                     "Price": [2,5,3,6]})

In [4]:
data

     Name    Type  Price
0   bread  bakery      2
1    beer  drinks      5
2  butter    deli      3
3  cheese    deli      6

In [7]:
#applying lambda function
data['inflated_price'] = data['Price'].apply(lambda x: x*1.4)

data

     Name    Type  Price  inflated_price
0   bread  bakery      2             2.8
1    beer  drinks      5             7.0
2  butter    deli      3             4.2
3  cheese    deli      6             8.4

In [10]:
#creating a flag column
data['price_label'] = data['inflated_price'].apply(
    lambda x: 'expensive' if x > 6 else ('acceptable' if x >=4 else 'cheap'))
data

     Name    Type  Price  inflated_price price_label
0   bread  bakery      2             2.8       cheap
1    beer  drinks      5             7.0   expensive
2  butter    deli      3             4.2  acceptable
3  cheese    deli      6             8.4   expensive